import React, {createContext} from 'react'
import newsItemOne from './images/news/newsItemOne.jpg'
import newsItemTwo from './images/news/newsItemTwo.jpg'
import newsItemThree from './images/news/newsItemThree.jpg'

const NewsContext = createContext({})

const NewsProvider = ({children, id}) => {
  const newsList = React.useMemo(() => [
    {
      id: 0,
      title: 'وزيرة الصناعة عن إحلال السيارات القديمة:القسط من 1500 جنيه',
      date: '29-12-2020',
      image: newsItemOne,
      short: 'كشفت الدكتورة نيفين جامع وزيرة الصناعة والتجارةتفاصيل مشروع تحويل السيارات للعمل بالغاز الطبيعي مؤك... ',
      full: 'كشفت الدكتورة نيفين جامع وزيرة الصناعة والتجارة تفاصيل مشروع تحويل السيارات للعمل بالغاز الطبيعي مؤكدة أنه مشروع قومي يحظى باهتمام الرئيس السيسي.\n' +
        '\n' +
        'وقالت الوزيرة خلال مداخلة مع الإعلامي أحمد موسى ببرنامج على مسئوليتي، إن المشروع يعتمد على إحلال السيارات بأخرى للعمل بالغاز الطبيعي وقبل العمل على المشروع تم التأكد من توفر البنية التحتية ووجود المحطات لتلبية طلبات البرنامج القومي.\n' +
        '\n' +
        'وأضافت الوزيرة أن عملية الإحلال تستهدف 250 ألف سيارة والبداية بـ70 ألف منهم 55 الف أجرة وملاكي و15 ألف ميكروباص والسيارة يكون مر على صناعتها 20 عام مشيرة إلى أن الإحلال اقتصادي وموفر للمواطن.\n' +
        '\n' +
        'وتابعت أن المرحلة الأولى ستكون سيارات تجميع محلي والمرحلة الثانية يتم الاتفاق مع شركات عالمية للعمل في المشروع وهناك حافز مغري جدا للإحلال وبرامج تمويلية مخفضة باقل من 3 % وفترة سداد ممكن تصل لعشر سنوات للمواطن الراغب في الإحلال. وأوضحت الدكتورة نيفين جامع أن قاعدة البيانات يتم تحديثها باستمرار، وهناك مليون سيارة ملاكي تم حصرها للدخول في عملية الإحلال ومتاح خيارات متعددة من السيارات تصل ل8 أنواع وسيتم الإعلان عن التفاصيل خلال معرض في يناير حسب توجيهات الرئيس عبدالفتاح السيسي وسيتم عرض نماذج للسيارات وعروض من شركات البترول.\n' +
        '\n' +
        'وحول تفاصيل التقديم والأسعار أكد الوزيرة أن القسط يبدأ من 1500 جنيه وسيتم سداد المقدم من الحافز الذي سيحصل عليه المواطن وسيتم تخريد السيارات التي تدخل في الإحلال.'
    },
    {
      id: 1,
      title: '12 نقطة.. تعرف علي تفاصيل مشروع إحلال السيارات(شروط جديدة)',
      date: '31-12-2020',
      image: newsItemTwo,
      short: 'كشفت الدكتورة نيفين جامع وزيرة الصناعة والتجارةتفاصيل مشروع تحويل السيارات للعمل بالغاز الطبيعي مؤك... ',
      full: 'كشفت الدكتورة نيفين جامع وزيرة الصناعة والتجارة تفاصيل مشروع تحويل السيارات للعمل بالغاز الطبيعي مؤكدة أنه مشروع قومي يحظى باهتمام الرئيس السيسي.\n' +
        '\n' +
        'وقالت الوزيرة خلال مداخلة على قناة صدي البلد، إن المشروع يعتمد على إحلال السيارات بأخرى للعمل بالغاز الطبيعي وقبل العمل على المشروع تم التأكد من توفر البنية التحتية ووجود المحطات لتلبية طلبات البرنامج القومي.\n' +
        '\n' +
        '\n' +
        '\n' +
        'وفيما يلي النقاط الهامة التي من الممكن التعرف عليها كي تتأكد هل سياراتك ضمن خطة الاحلال الجديدة ام لا\n' +
        '\n' +
        '1 عملية الإحلال تستهدف 250 ألف سيارة\n' +
        '\n' +
        '2 ‏البداية سوف تكون بـ70 ألف منهم 55 الف أجرة وملاكي و15 ألف ميكروباص\n' +
        '\n' +
        '3السيارة يكون مر على صناعتها 20 عام\n' +
        '\n' +
        '‏4 المرحلة الأولى ستكون سيارات تجميع محلي .\n' +
        '\n' +
        '5 المرحلة الثانية يتم الاتفاق مع شركات عالمية للعمل في المشروع\n' +
        '\n' +
        '6 هناك حافز مغري جدا للإحلال وبرامج تمويلية مخفضة باقل من 3 %\n' +
        '\n' +
        '7 فترة سداد من الممكن ان تصل لعشر سنوات للمواطن الراغب في الإحلال.\n' +
        '\n' +
        '8 قاعدة البيانات يتم تحديثها باستمرار .\n' +
        '\n' +
        '9 ‏هناك مليون سيارة ملاكي تم حصرها للدخول في عملية الإحلال.\n' +
        '\n' +
        '10 متاح خيارات متعددة من السيارات تصل ل8 أنواع\n' +
        '\n' +
        '11 ‏سيتم الإعلان عن التفاصيل خلال معرض في يناير وسيتم عرض نماذج للسيارات وعروض من شركات البترول.\n' +
        '\n' +
        '12 القسط يبدأ من 1500 جنيه وسيتم سداد المقدم من الحافز الذي سيحصل عليه المواطن وسيتم تخريد السيارات التي تدخل في الإحلال .'
    },
    {
      id: 2,
      title: '20 معلومة عن شروط إحلال السيارات للعمل بالغاز 15يناير',
      date: '02-01-2021',
      image: newsItemThree,
      short: ' انتشر مؤخرا لغط وتساؤلات كثيرة حول تحويل السيارات للعمل بالغاز الطبيعى وإحلال المركبات القديمة، وهو.',
      full: ' انتشر مؤخرا لغط وتساؤلات كثيرة حول تحويل السيارات للعمل بالغاز الطبيعى وإحلال المركبات القديمة، وهو المشروع الذى تعمل عليه الحكومة المصرية حاليا بشراكة بين أكثر من وزارة، وفيما يلي أهم المعلومات عن التحول للغاز الطبيعي:\n' +
        '\n' +
        ' \n' +
        '\n' +
        '- مبادرة إحلال السيارات القديمة تعمل على محورين، الأول، وهو تشغيل السيارات التى عمرها أقل من 20 عاماً بالغاز، والمحور الثاني، وهو السيارات التى تخطي عمرها الـ20 عاماً.\n' +
        '\n' +
        '- الحكومة تتيح نظم للسداد تصل إلى 10 سنوات، وهى أطول فترة لم تحدث فى وقت سابق.\n' +
        '\n' +
        '- المبادرة تقدم حافزاً مقابل تحويل السيارة، والمبلغ سيكون متفاوتاً وفقاً للسيارة وسيسمي الحافز الأخضر.\n' +
        '\n' +
        '- الرئيس السيسي وجه بضم السيارات الملاكي لمباردة إحلال السيارات للعمل بالغاز.\n' +
        '\n' +
        '- النصف الثاني من شهر يناير سيتم إعلان شروط وضوابط إحلال السيارات في مصر بالتفاصيل الكاملة.\n' +
        '\n' +
        '- تحويل المركبات اللعمل بالغاز يوفر 50% من تكلفة التشغيل.\n' +
        '\n' +
        '- تستهدف الحكومة 70 ألف سيارة منها سيارات ملاكي وسيارات أجرة.\n' +
        '\n' +
        '- المرحلة الثانية ستكون حوالي 90 ألف سيارة وكذلك المرحلة الثالثة ستشمل 90 ألف سيارة.\n' +
        '\n' +
        '- خصصت الحكومة 1.2 مليار جنيه لتحويل السيارات للعمل بالوقود المزدوج خلال أغسطس الماضي.\n' +
        '\n' +
        '- تسهيل في الإجراءات التمويلية للتعاقد وتضاف إلى الوفر الاقتصادي الذي سيعود على المواطنين من خلال ترشيد استهلاك البنزين.\n' +
        '\n' +
        '- البرنامج القومي لتحويل للغاز الطبيعي باشتراك كبرى الشركات العالمية المصنعة للسيارات.\n' +
        '\n' +
        '- خطة لتحويل 1.8 مليون سيارة للعمل بالغاز الطبيعي في محاولة لتقليل الاعتماد على البنزين.\n' +
        '\n' +
        '- الخطة الحكومية تعتمد أيضا على استيراد السيارات ذات المحركات المزدوجة للعمل بالغاز.\n' +
        '\n' +
        '- يتولي جهاز تنمية المشروعات الصغيرة والمتوسطة دعم تحويل السيارات للعمل بالغاز.\n' +
        '\n' +
        '- الجدول الزمني المتوقع للخطة من 5 إلى 10 سنوات.\n' +
        '\n' +
        '- شركات التجميع المحلي ستعمل على إضافة ميزة العمل بالوقود المزدوج في السيارات التي تعمل عليها.\n' +
        '\n' +
        '- الخطة بشكلها القديم لم يكن الملاكي مدرج فيها.\n' +
        '\n' +
        '- تعمل على تنفيذ الخطة الحكومية وزارت الصناعة والبترول وقطاع الأعمال والمالية والإنتاج الحربي.\n' +
        '\n' +
        '- تحويل السيارة للعمل بالغار الطبيعى يستغرق فترة زمنية تتراوح ما بين 2 إلى 4 ساعات حسب نوع السيارة.\n' +
        '\n' +
        '- أنظمة التحويل الجديدة لكافة السيارات بجميع سعاتها اللترية المختلفة للعمل بالغاز الطبيعى.\n' +
        '\n' +
        '- تتاح عمليات التحويل للسيارات ذات السعة اللترية الكبيرة التي تتجاوز 2500 cc .\n' +
        '\n' +
        '- الفحص الفنى للسيارة من خلال فنيين متخصصين للتأكد من صلاحية المحرك بنسبة لاتقل عن 70% لضمان أفضل أداء للسيارة'
    }
  ], [])
  const [newsDetails, setNewsDetails] = React.useState({})

  React.useEffect(() => {
    if (!!id) {
      if (!!newsList.length) {
        let arr = newsList.filter((item) => {
          return id.indexOf(item.id) !== -1
        })
        setNewsDetails(arr.slice(-1)[0])
      }
    }
  }, [newsList, id])

  return (
    <NewsContext.Provider value={{
      newsList,
      newsDetails
    }}>
      {children}
    </NewsContext.Provider>
  )
}
const NewsConsumer = NewsContext.Consumer

export {NewsProvider, NewsConsumer}
